<a href="https://colab.research.google.com/github/JakeOh/202105_itw_bd26/blob/main/lab_da/da11_merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# DataFrame 합치기

* merge(join): 두 개의 DataFrame을 공통된 컬럼(들)을 기준으로 합치는 것.
* concat: DataFrame을 축(axis)을 따라서 합치는 것.

In [1]:
import numpy as np
import pandas as pd

# merge

In [3]:
emp = pd.DataFrame({
    'empno': [100, 101, 102, 103],
    'ename': ['Scott', 'King', 'Allen', 'Tiger'],
    'deptno': [10, 20, 10, 50]
})
emp

   empno  ename  deptno
0    100  Scott      10
1    101   King      20
2    102  Allen      10
3    103  Tiger      50

In [4]:
dept = pd.DataFrame({
    'deptno': [10, 20, 30],
    'dname': ['IT', 'HR', 'Sales']
})
dept

   deptno  dname
0      10     IT
1      20     HR
2      30  Sales

In [7]:
# pd.merge 함수
pd.merge(emp, dept, how='inner', on='deptno')
# how: join 방식. inner, left, right, outer. inner는 생략가능(default argument)
# on: join의 기준이 되는 컬럼(들의 리스트). 컬럼 이름이 같은 경우에는 on도 생략 가능.

   empno  ename  deptno dname
0    100  Scott      10    IT
1    102  Allen      10    IT
2    101   King      20    HR

In [9]:
# pd.DataFrame.merge 메서드
emp.merge(dept)

   empno  ename  deptno dname
0    100  Scott      10    IT
1    102  Allen      10    IT
2    101   King      20    HR

In [10]:
# left (outer) join
pd.merge(emp, dept, how='left')  # on='deptno' 생략 가능.

   empno  ename  deptno dname
0    100  Scott      10    IT
1    101   King      20    HR
2    102  Allen      10    IT
3    103  Tiger      50   NaN

In [12]:
# right (outer) join
pd.merge(emp, dept, how='right')

   empno  ename  deptno  dname
0  100.0  Scott      10     IT
1  102.0  Allen      10     IT
2  101.0   King      20     HR
3    NaN    NaN      30  Sales

In [13]:
# full outer join
pd.merge(emp, dept, how='outer')

   empno  ename  deptno  dname
0  100.0  Scott      10     IT
1  102.0  Allen      10     IT
2  101.0   King      20     HR
3  103.0  Tiger      50    NaN
4    NaN    NaN      30  Sales

join 기준이 되는 컬럼 이름이 서로 다른 경우

In [14]:
employees = pd.DataFrame({
    'empno': [100, 101, 102, 103],
    'ename': ['Scott', 'King', 'Allen', 'Tiger'],
    'deptno': [10, 20, 10, 50]
})
employees

   empno  ename  deptno
0    100  Scott      10
1    101   King      20
2    102  Allen      10
3    103  Tiger      50

In [15]:
departments = pd.DataFrame({
    'dno': [10, 20, 30],
    'dname': ['IT', 'HR', 'Sales']
})
departments

   dno  dname
0   10     IT
1   20     HR
2   30  Sales

In [16]:
pd.merge(employees, departments, how='inner', left_on='deptno', right_on='dno')

   empno  ename  deptno  dno dname
0    100  Scott      10   10    IT
1    102  Allen      10   10    IT
2    101   King      20   20    HR

인덱스를 사용한 merge

In [18]:
np.random.seed(1)

df1 = pd.DataFrame(data={'value1': np.random.randint(10, size=6), 
                         'value2': np.random.randint(100, size=6)},
                   index=['a', 'b', 'c'] * 2)
df1

   value1  value2
a       5       1
b       8      76
c       9      71
a       5       6
b       0      25
c       0      50

In [19]:
np.random.seed(2)

df2 = pd.DataFrame(data={'data1': np.random.rand(3),
                         'data2': np.random.randn(3)},
                   index=['a', 'b', 'c'])
df2

      data1     data2
a  0.435995 -1.953796
b  0.025926 -1.586882
c  0.549662 -1.074456

In [20]:
pd.merge(df1, df2, how='inner', left_index=True, right_index=True)

   value1  value2     data1     data2
a       5       1  0.435995 -1.953796
a       5       6  0.435995 -1.953796
b       8      76  0.025926 -1.586882
b       0      25  0.025926 -1.586882
c       9      71  0.549662 -1.074456
c       0      50  0.549662 -1.074456

컬럼과 인덱스를 사용한 merge

In [21]:
df1 = pd.DataFrame(data={'value1': np.arange(6),
                         'value2': ['a', 'b', 'c'] * 2})
df1

   value1 value2
0       0      a
1       1      b
2       2      c
3       3      a
4       4      b
5       5      c

In [22]:
df2 = pd.DataFrame(data={'data': [10, 20, 30]},
                   index=['a', 'b', 'c'])
df2

   data
a    10
b    20
c    30

In [25]:
pd.merge(df1, df2, how='inner', left_on='value2', right_index=True)

   value1 value2  data
0       0      a    10
3       3      a    10
1       1      b    20
4       4      b    20
2       2      c    30
5       5      c    30

# concat

## pd.Series의 concat

In [26]:
s1 = pd.Series(data=['a', 'b', 'c'])
s1

0    a
1    b
2    c
dtype: object

In [27]:
s2 = pd.Series(data=['d', 'e'])
s2

0    d
1    e
dtype: object

In [29]:
result = pd.concat([s1, s2], axis=0)  # axis=0은 생략 가능(defualt argument)
result  #> 결과는 Series

0    a
1    b
2    c
0    d
1    e
dtype: object

In [31]:
result.loc[0]

0    a
0    d
dtype: object

In [33]:
pd.concat([s1, s2], ignore_index=True)
# ignore_index: 이어줄 Series 또는 DataFrame의 index를 무시할 지를 결정. 기본값은 False.

0    a
1    b
2    c
3    d
4    e
dtype: object

axis=1 방향 concat

In [35]:
pd.concat([s1, s2], axis=1)  #> 결과는 DataFrame

   0    1
0  a    d
1  b    e
2  c  NaN

In [36]:
np.random.seed(1)
s1 = pd.Series(data=np.random.randn(3), index=['a', 'b', 'c'])
s2 = pd.Series(data=np.random.randn(3), index=['d', 'e', 'f'])

In [38]:
s1

a    1.624345
b   -0.611756
c   -0.528172
dtype: float64

In [39]:
s2

d   -1.072969
e    0.865408
f   -2.301539
dtype: float64

In [37]:
# axis=0 방향 concat => 결과는 Series
pd.concat([s1, s2])

a    1.624345
b   -0.611756
c   -0.528172
d   -1.072969
e    0.865408
f   -2.301539
dtype: float64

In [40]:
# axis=1 방향 concat => 결과는 (6, 2) shape의 DataFrame
pd.concat([s1, s2], axis=1)

          0         1
a  1.624345       NaN
b -0.611756       NaN
c -0.528172       NaN
d       NaN -1.072969
e       NaN  0.865408
f       NaN -2.301539

## pandas.DataFrame의 concat

In [43]:
np.random.seed(1)

mid_term = pd.DataFrame(data=np.random.randint(100, size=(5, 3)),
                        columns=['math', 'science', 'computer'])
final_term = pd.DataFrame(data=np.random.randint(100, size=(5, 3)),
                          columns=['math', 'science', 'computer'])

In [44]:
mid_term

   math  science  computer
0    37       12        72
1     9       75         5
2    79       64        16
3     1       76        71
4     6       25        50

In [45]:
final_term

   math  science  computer
0    20       18        84
1    11       28        29
2    14       50        68
3    87       87        94
4    96       86        13

In [47]:
# axis=0 concat
pd.concat([mid_term, final_term], ignore_index=True)

   math  science  computer
0    37       12        72
1     9       75         5
2    79       64        16
3     1       76        71
4     6       25        50
5    20       18        84
6    11       28        29
7    14       50        68
8    87       87        94
9    96       86        13

In [48]:
# axis=1 concat
pd.concat([mid_term, final_term], axis=1)

   math  science  computer  math  science  computer
0    37       12        72    20       18        84
1     9       75         5    11       28        29
2    79       64        16    14       50        68
3     1       76        71    87       87        94
4     6       25        50    96       86        13

In [51]:
np.random.seed(1)

df1 = pd.DataFrame(data=np.random.rand(3, 3),
                   index=['a', 'b', 'c'],
                   columns=['data1', 'data2', 'data3'])
df2 = pd.DataFrame(data=np.random.rand(2, 2),
                   index=['a', 'b'],
                   columns=['data2', 'data3'])

In [52]:
df1

      data1     data2     data3
a  0.417022  0.720324  0.000114
b  0.302333  0.146756  0.092339
c  0.186260  0.345561  0.396767

In [53]:
df2

      data2     data3
a  0.538817  0.419195
b  0.685220  0.204452

In [54]:
# axis=0 concat
pd.concat([df1, df2])

      data1     data2     data3
a  0.417022  0.720324  0.000114
b  0.302333  0.146756  0.092339
c  0.186260  0.345561  0.396767
a       NaN  0.538817  0.419195
b       NaN  0.685220  0.204452

In [57]:
# axis=1 concat
pd.concat([df1, df2], axis=1)

      data1     data2     data3     data2     data3
a  0.417022  0.720324  0.000114  0.538817  0.419195
b  0.302333  0.146756  0.092339  0.685220  0.204452
c  0.186260  0.345561  0.396767       NaN       NaN

# merge, concat 연습

* https://github.com/pandas-dev/pandas/tree/master/doc/data/ 데이터 사용
* air_quality_no2_long.csv, air_quality_pm25_long.csv, air_quality_stations.csv 파일을 읽고 데이터 프레임 생성.
* air_quality_no2와 air_quality_pm25를 합치세요.
* 위 결과 데이터프레임과 stations 데이터프레임을 합치세요.